{
  "_attn_implementation_autoset": true,
  "_name_or_path": "xlm-roberta-base",
  "architectures": [
    "XLMRobertaForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "abbreviation",
    "1": "aircraft",
    "2": "airfare",
    "3": "airline",
    "4": "airport",
    "5": "capacity",
    "6": "cheapest",
    "7": "city",
    "8": "distance",
    "9": "flight",
    "10": "flight_no",
    "11": "flight_time",
    "12": "ground_fare",
    "13": "ground_service",
    "14": "meal",
    "15": "quantity",
    "16": "restriction"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "abbreviation": 0,
    "aircraft": 1,
    "airfare": 2,
    "airline": 3,
    "airport": 4,
    "capacity": 5,
    "cheapest": 6,
    "city": 7,
    "distance": 8,
    "flight": 9,
    "flight_no": 10,
    "flight_time": 11,
    "ground_fare": 12,
    "ground_service": 13,
    "meal": 14,
    "quantity": 15,
    "restriction": 16
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "transformers_version": "4.46.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
